app/views/shelter_pets/index.html.erb

SELECT "pets".* FROM "pets" WHERE "pets"."shelter_id" = $1  [["shelter_id", 2779]]
---
  <div style="text-align:center;font-family:arial">
    <% @shelter.pets.each do |pet| %>