app/views/shelter/show.html.erb

SELECT COUNT(*) FROM "pets" WHERE "pets"."shelter_id" = $1  [["shelter_id", 2783]]
---
      <p> <%= @shelter.zip %></p>
      <p> <%= @shelter.pets.count %> <%= "Adoptable Pet(s)"%></p>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."shelter_id" = $1  [["shelter_id", 51]]
---
        <br/>
      <% @shelter.reviews.each do |review| %>