app/controllers/favorites_controller.rb

  def update
    pet = Pet.find(params[:pet_id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]