app/controllers/pets_controller.rb

  def show
    @pet = Pet.find(params[:pet_id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 1488], ["LIMIT", 1]]

  def edit
    @pet_to_edit = Pet.find(params[:pet_id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 1490], ["LIMIT", 1]]

  def update
    @pet_to_edit = Pet.find(params[:pet_id])
    if @pet_to_edit.update(pet_params)
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 1490], ["LIMIT", 1]]
UPDATE "pets" SET "image" = $1, "name" = $2, "description" = $3, "approx_age" = $4, "sex" = $5, "updated_at" = $6 WHERE "pets"."id" = $7

  def destroy
    pet_to_delete = Pet.find(params[:pet_id])
    if pet_to_delete.status == "Pending"
      flash[:error] = "Pet cannot be deleted due to pending application status"
        redirect_to "/pets/#{pet_to_delete.id}"
    else
      favorites.contents.delete(pet_to_delete.id.to_s)
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 1488], ["LIMIT", 1]]
DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 1488]]