app/controllers/reviews_controller.rb

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 435], ["LIMIT", 1]]
---
  def new
    @shelter = Shelter.find(params[:shelter_id])

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 509], ["LIMIT", 1]]
INSERT INTO "reviews" ("title", "rating", "content", "picture", "created_at", "updated_at", "shelter_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @shelter = Shelter.find(params[:shelter_id])
    review = @shelter.reviews.new(review_params)
    if review.save