app/controllers/shelter_controller.rb

SELECT "shelters".* FROM "shelters"
---
  def index
    @shelters = Shelter.all

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 2783], ["LIMIT", 1]]
---
  def show
    @shelter = Shelter.find(params[:id])

INSERT INTO "shelters" ("name", "address", "city", "state", "zip", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    shelter = Shelter.new(shelter_params)
    if shelter.save

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 2785], ["LIMIT", 1]]
---
  def edit
    @shelter_to_edit = Shelter.find(params[:id])

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 2785], ["LIMIT", 1]]
UPDATE "shelters" SET "name" = $1, "address" = $2, "city" = $3, "state" = $4, "zip" = $5, "updated_at" = $6 WHERE "shelters"."id" = $7  [["name", "Riverside Shelter"], ["address", "3197 Sutherland Parkway"], ["city", "Riverside"], ["state", "California"], ["zip", "90217"], ["updated_at", "2020-03-24 00:41:27.882101"], ["id", 2785]]
---
  def update
    @shelter_to_edit = Shelter.find(params[:id])
    if @shelter_to_edit.update(shelter_params)

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 2783], ["LIMIT", 1]]
DELETE FROM "shelters" WHERE "shelters"."id" = $1  [["id", 2783]]
---
  def destroy
    shelter_to_delete = Shelter.find(params[:id])
    shelter_to_delete.destroy