app/controllers/shelter_pets_controller.rb

  def index
    @shelter = Shelter.find(params[:shelter_id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 2779], ["LIMIT", 1]]

  def new
    @shelter = Shelter.find(params[:shelter_id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 2779], ["LIMIT", 1]]

  def create
    # @shelter = Shelter.find(params[:shelter_id])
    # pet = @shelter.pets.create(pet_params)
    # redirect_to "/shelters/#{@shelter.id}/pets"

    @shelter = Shelter.find(params[:shelter_id])
    pet = @shelter.pets.create(pet_params)
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 2779], ["LIMIT", 1]]
INSERT INTO "pets" ("image", "name", "approx_age", "sex", "created_at", "updated_at", "shelter_id", "description") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"